i = 1;
while i <= 5:
    print('helloworld')
    i += 1
print('-'*25)

# 求1-100的和
sum = 0
i = 1
while i <= 100:
    sum += i
    i += 1
print(f'1-100的和为{sum}')

#求1-100中偶数的和
#方法一
sum = 0
i = 1
while i <= 100:
    if i % 2 == 0:
        sum += i
    i += 1
print(f'1-100中偶数的和为{sum}')
# 方法二
sum = 0
i = 2
while i <= 100:
    sum += i
    i += 2
print(f'1-100中偶数的和为{sum}')

"""
  统计100-1000（包左不包右）中水仙花数的个数

    需求1:打印所有的水仙花数.
    需求2:统计水仙花数的个数.
   
    水仙花数解释:
    1.它是1个三位数.
    2、它的各个位数的立方和相加= 它本身.
    3.例如:153=1*1*1+5*5*5+3*3*3=153，所以 153就是水仙花数.
"""
i = 100
count = 0
while i < 1000:
    ge = i // 1 % 10
    shi = i // 10 % 10
    bai = i // 100 % 10
    if bai * bai * bai + shi * shi * shi + ge * ge * ge == i:
        print(f'水仙花为{i}')
        count += 1

    i += 1
print(f'水仙花的个数为{count}')


# 打印5*5矩形
i = 1
while i <= 5:            #控制行
    j = 1
    while j <= 5:       #控制列
        print('*', end='')
        j += 1
    print()              #换行
    i += 1
print('-'*25)


# 打印正三角和打印矩形相比，内循环的判断条件发生改变
# 打印倒三角和打印矩形相比，内循环的初始化条件发生改变
"""
    1：打印9*9的 矩形
    2：将上述图形改为三角形
    3：用1*3=3来代替上述的*
    4：用i和j来填充即可
"""
#打印正三角
i = 1
while i <= 5:            #控制行 i的值：1    2      3           4           5
    j = 1
    while j <= i:       #控制列 j的值：1    1，2    1，2，3，    1，2，3，4    1，2，3，4，5
        print('*', end='\t')
        j += 1
    print()              #换行
    i += 1

print('-'*25)

#打印倒三角
i = 1
while i <= 5:           #控制行  i的值：1                 2             3         4     5
    j = i
    while j <= 5:       #控制列  j的值：1，2，3，4，5     2，3，4，5     3，4，5    4，5   5
        print('*', end='\t')
        j += 1
    print()              #换行
    i += 1

print('-'*25)

#打印99乘法表

i = 1
while i <= 9:            #控制行
    j = 1
    while j <= i:       #控制列
        print(f'{j} * {i} = {i * j}', end='\t')
        j += 1
    print()              #换行
    i += 1
print('-'*25)